let array = [2, 17, 7, 12, 1, 9, 8, 25, 5, 27];
let target = 6;

function linearSearch(array, target) {
    for (let i = 0; i < array.length; i++) {
      if (array[i] === target) { 
        return i;
      }
    }
    return -1;
}

console.log(linearSearch(array, target)) 

// функція приймає масив і значення яке шукаємо
// починаємо пошук з 0 індексу і порівнюємо кожне значення масиву з тим яке шукаємо
// пошук зупиняється, якщо умова виконується і в результаті отримуємо індекс цього елементу в масиві
// якщо відповідного значення не знайдено, після проходження всього масиву отримуємо індекс -1